var ap = new APlayer
		({
			container: document.getElementById('aplayer'),
			lrcType: 1,
				audio: [{
					name: 'going...',
					artist: '電音部',
					url: 'https://webdisk.creationwong.xyz/d/%E7%AB%99%E9%95%BF%E6%96%87%E4%BB%B6/HIFI/going%E2%80%A6.flac',
					cover: 'https://webdisk.creationwong.xyz/d/%E7%AB%99%E9%95%BF%E6%96%87%E4%BB%B6/HIFI/going%E2%80%A6.jpg',
					lrc: '[00:00.000]going…\n' +
							'[00:03.000]　\n' +
							'[00:16.970]久しぶりの雨の匂い\n' +
							'[00:19.850]黒く霞んだ雲間にも朝が降る\n' +
							'[00:24.520]また1日をはじめよう\n' +
							'[00:27.350]渡る交差点　見上げた信号は青\n' +
							'[00:31.750]　\n' +
							'[00:31.760]毎日近付くミライ\n' +
							'[00:34.820]追いつけないようなスピードで\n' +
							'[00:38.570]色鮮やかに染まったセカイ\n' +
							'[00:42.320]私だけの未完成な色\n' +
							'[00:46.670]　\n' +
							'[00:46.680]そっと辿る記憶の片隅にいつもメロディ…\n' +
							'[01:01.820]　\n' +
							'[01:01.830]遠く感じる痛み　私の心を前に向ける\n' +
							'[01:08.600]大切な気持ち　ありがとう\n' +
							'[01:16.820]　\n' +
							'[01:47.020]傷だらけのスニーカー\n' +
							'[01:49.850]靴紐ぎゅっと硬く結び直して\n' +
							'[01:54.500]時間が経ったと気付く\n' +
							'[01:57.320]暗くて重いあの日ペトリコールから\n' +
							'[02:01.670]　\n' +
							'[02:01.680]夢に見た自分が遠くて　深く沈んだ海の底\n' +
							'[02:08.550]君になれないこのイビツさも\n' +
							'[02:12.350]私だけの未完成な色？\n' +
							'[02:16.700]　\n' +
							'[02:16.710]水面を青白く照らす片割れた月が綺麗…\n' +
							'[02:31.720]　\n' +
							'[02:31.730]眼を閉じるその度に浮かぶ鮮やかな思い出\n' +
							'[02:38.600]ひたすらに重ねた軌跡が\n' +
							'[02:42.320]きっと私だけの強さ\n' +
							'[02:46.070]　\n' +
							'[02:46.080]消えない遠く感じる痛み\n' +
							'[02:49.850]胸の奥で確かめたなら\n' +
							'[02:53.600]今君の元へ駆けていくよ\n' +
							'[03:02.220]　\n',
			}]
		});
		ap.init();